=begin
  ::                    Разрешение области видимости
  []                    Взятие индекса
  **                    Возведение в степень
  + - ! ~               Унарный плюс/минус, НЕ ...
  */ %                  Умножение, деление ...
  +­ -                   Сложение/вычитание
  <<>>                  Логические сдвиги ...
  &                     Поразрядное И
  | ^                   Поразрядное ИЛИ, ИСКЛЮЧАЮЩЕЕ ИЛИ
  > >= < <=             Сравнение
  == === <=> != =~ !~   Равенство, неравенство ...
  &&                    Логическое И
  ||                    Логическое ИЛИ
  .. ...                Операторы диапазона
  = (also +=, -=, ... ) Присваивание
  ?:                    Тернарный выбор
  not                   Логическое отрицание
  and or                Логическое И, ИЛИ
=end
