# Можно вычислить интервал между двумя моментами времени. В результате вычитания одного объекта Time из другого получаем число секунд

today = Time.local(2000,11,10)
yesterday = Time.local(2000,11,9)
cliff = today - yesterday # 86400 секунд.

# И снова оказывается полезной функция sec2dhms, которая определена в разделе 7.6.

def sec2dhms(seсs)
 time = seсs.round           # Отбрасываем микросекунды.
 sec = time % 60             # Извлекаем секунды.
 time /= 60                  # Отбрасываем секунды.
 mins = time % 60            # Извлекаем минуты.
 time /= 60                  # Отбрасываем минуты.
 hrs = time % 24             # Извлекаем часы.
 time /= 24                  # Отбрасываем часы.
 days = time                 # Дни (последний остаток).
 [days, hrs, mins, sec]      # Возвращаем массив [d,h,m,s].
end

past = Time. local(1998,9,13,4,15)
now = Time.local(2000,11,10,22,42)
diff = now - past
unit = sec2dhms(diff)

puts "#{unit[0]} дней,"     # 789 дней,
puts "#{unit[1]} часов,"    # 18 часов,
puts "#{unit[2]} минут"     # 27 минут
puts "и #{unit[3]} секунд." # и 0 секунд.
