name = "Боб"
age = 28

p sprintf("Привет, %s... Похоже, тебе %d лет.", name, age)

p '#'

p sprintf("Привет, %-20s Похоже, тебе %3d лет.", name, age)

p '#'

p "Привет, %-20s Похоже, тебе %3d лет." % [name, age] # To же, что и выше

p '#'

str = "Моби Дик"
p str.ljust(12)  # "Моби Дик"
p str.center(12) # "  Моби Дик  "
p str.rjust(12)  # "    Моби Дик"

p '#'

str = "Капитан Ахав"
p str.ljust(20,"+")   # "Капитан Ахав++++++++"
p str.center(20,"-")  # "----Капитан Ахав----"
p str.rjust(20,"123") # "12312312Капитан Ахав"
