p 237  # Число без знака (положительное).
p +237 # То же, что и выше.
p -237 # Отрицательное число.

p 1048576   # Число в обычной записи.
p 1_048_576 # То же самое значение.

# Целые числа можно представлять и в других системах счисления (по основанию 2, 8 и 16).
# Для этого в начале ставятся префиксы 0b, 0 и 0х

p 0b10010110 # Двоичное.                          150
p 01234      # Восьмеричное (основание 8).        668
p 0xdeadbeef # Шестнадцатеричное (основание 16) . 3735928559
p 0xDEADBEEF # То же самое.                       3735928559
